danieleff/STM32GENERIC/STM32/boards.txt
#################################### Nucleo-144 ############################################
# NUCLEO 144 board

NUCLEO_144.name=Nucleo-144 boards
#vid pid confuses arduino port naming
#NUCLEO_144.vid.0=0x0483
#NUCLEO_144.pid.0=0x374B

NUCLEO_144.build.core=arduino
NUCLEO_144.build.board=NUCLEO_144
NUCLEO_144.upload.tool=nucleoFlasher

NUCLEO_144.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3


NUCLEO_144.menu.subboard.Nucleo_F767ZI=Nucleo-F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.upload.maximum_size=2097152
NUCLEO_144.menu.subboard.Nucleo_F767ZI.upload.maximum_data_size=524288
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -DHSE_VALUE=8000000
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.series=STM32F7
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.variant=NUCLEO_F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.board=NUCLEO_F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.extra_flags=-DSTM32F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.massstorage_drive=NODE_F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.f_cpu=216000000L


NUCLEO_144.menu.upload_method.MassStorageMethod=Mass Storage
NUCLEO_144.menu.upload_method.MassStorageMethod.upload.protocol=
NUCLEO_144.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

NUCLEO_144.menu.upload_method.STLinkMethod=STLink
NUCLEO_144.menu.upload_method.STLinkMethod.upload.protocol=STLink
NUCLEO_144.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

################################################################################
# Discovery L053C8 board

DISCOVERY_L053C8.name=Discovery L053C8

DISCOVERY_L053C8.upload.maximum_size=65536
DISCOVERY_L053C8.upload.maximum_data_size=8192

DISCOVERY_L053C8.build.core=arduino
DISCOVERY_L053C8.build.board=DISCO_L053C8

DISCOVERY_L053C8.build.mcu=cortex-m0
DISCOVERY_L053C8.build.series=STM32L0
DISCOVERY_L053C8.build.variant=DISCOVERY_L053C8
DISCOVERY_L053C8.build.extra_flags=-DSTM32L053C8
DISCOVERY_L053C8.build.f_cpu=32000000L

DISCOVERY_L053C8.upload.protocol=STLink
DISCOVERY_L053C8.upload.tool=stlink_upload

DISCOVERY_L053C8.menu.upload_method.STLinkMethod=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_L053C8.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

DISCOVERY_L053C8.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
DISCOVERY_L053C8.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_L053C8.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_L053C8.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_L053C8.menu.usb.Disabled=Disabled, no USB

DISCOVERY_L053C8.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/PA10]
DISCOVERY_L053C8.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_L053C8.menu.serial.SerialUSB=SerialUSB (USB connector)
DISCOVERY_L053C8.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

####################################### Discovery F303VC #########################################
# Discovery F303VC board

DISCOVERY_F303VC.name=Discovery F303VC

DISCOVERY_F303VC.upload.maximum_size=524288
DISCOVERY_F303VC.upload.maximum_data_size=40960

DISCOVERY_F303VC.build.core=arduino
DISCOVERY_F303VC.build.board=DISCO_F303VC

DISCOVERY_F303VC.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F303VC.build.series=STM32F3
DISCOVERY_F303VC.build.variant=DISCOVERY_F303VC
DISCOVERY_F303VC.build.extra_flags=-DSTM32F303VC
DISCOVERY_F303VC.build.f_cpu=72000000L

DISCOVERY_F303VC.upload.protocol=STLink
DISCOVERY_F303VC.upload.tool=stlink_upload

DISCOVERY_F303VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

#DISCOVERY_F303VC.menu.usb.Disabled=Disabled, no USB
#DISCOVERY_F303VC.menu.usb.SerialUSB=Serial [Virtual COM port]
#DISCOVERY_F303VC.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
#DISCOVERY_F303VC.menu.usb.SerialMSC=Mass storage
#DISCOVERY_F303VC.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

#DISCOVERY_F303VC.menu.serial.SerialUSB=SerialUSB
#DISCOVERY_F303VC.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#DISCOVERY_F303VC.menu.serial.SerialUART2=SerialUART2 [PA2/PA3]
#DISCOVERY_F303VC.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

################################################################################
# Discovery F407VG board

DISCOVERY_F407VG.name=Discovery F407VG

DISCOVERY_F407VG.upload.maximum_size=1048576
DISCOVERY_F407VG.upload.maximum_data_size=131072

DISCOVERY_F407VG.build.core=arduino
DISCOVERY_F407VG.build.board=DISCO_F407VG

DISCOVERY_F407VG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F407VG.build.series=STM32F4
DISCOVERY_F407VG.build.variant=DISCOVERY_F407VG
DISCOVERY_F407VG.build.extra_flags=-DSTM32F407VG -DHSE_VALUE=8000000
DISCOVERY_F407VG.build.f_cpu=168000000L

DISCOVERY_F407VG.upload.protocol=STLink
DISCOVERY_F407VG.upload.tool=stlink_upload

DISCOVERY_F407VG.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F407VG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F407VG.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F407VG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F407VG.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F407VG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F407VG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
DISCOVERY_F407VG.menu.serial.SerialUART2=SerialUART2 [PA2/PA3]
DISCOVERY_F407VG.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

################################################################################
# Discovery F429ZI board

DISCOVERY_F429ZI.name = Discovery F429ZI

# TBD: correct memory settings here and in ldscript !!
DISCOVERY_F429ZI.upload.maximum_size=1048576
DISCOVERY_F429ZI.upload.maximum_data_size=131072

DISCOVERY_F429ZI.build.core=arduino
DISCOVERY_F429ZI.build.board=DISCO_F429ZI

